; domain
(define (domain joint_teleport-assistance7_domain)
(:requirements :typing :action-costs)

(:types
    place telstatus - object
)

(:constants
    enabled disabled - telstatus
)

(:predicates
    (prime_turn)
    (supporter_turn)
    (at-prime ?p -  place)
    (at-teleport ?p - place ?s -  telstatus)
    (teleport_can_be_activated)
    (is-goal ?p -  place)
    (free ?p -  place)
    (adj-walk ?p1 - place ?p2 -  place)
)

(:functions
    (total-cost) - number
)

(:action sup_activate-teleport
    :parameters (?pos1 ?pos2 - place)
    :precondition (and
        (supporter_turn)
        (teleport_can_be_activated)
        (at-teleport ?pos1 disabled)
        (is-goal ?pos2)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (at-teleport ?pos1 enabled)
        (not (teleport_can_be_activated))
        (not (at-teleport ?pos1 disabled))
        (not (free ?pos2))
        (increase (total-cost) 1.0)
    )
)

(:action sup_use-teleport
    :parameters (?pos1 ?pos2 - place)
    :precondition (and
        (supporter_turn)
        (at-prime ?pos1)
        (at-teleport ?pos1 enabled)
        (is-goal ?pos2)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (at-prime ?pos2)
        (not (at-prime ?pos1))
        (increase (total-cost) 1.0)
    )
)

(:action pri_walk
    :parameters (?from - place ?to - place)
    :precondition (and
        (prime_turn)
        (adj-walk ?from ?to)
        (free ?to)
        (at-prime ?from)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (at-prime ?to)
        (not (at-prime ?from))
        (increase (total-cost) 1000.0)
    )
)

(:action pri_noop
    :parameters ()
    :precondition (and
        (prime_turn)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (increase (total-cost) 0)
    )
)

(:action sup_noop
    :parameters ()
    :precondition (and
        (supporter_turn)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (increase (total-cost) 0)
    )
)

)

; problem
(define (problem joint_teleport-assistance7_problem_151)
(:domain joint_teleport-assistance7_domain)
(:objects
    pos0-1 pos0-2 pos0-3 pos0-4 pos1-4 pos1-5 pos1-6 pos1-7 pos1-8 pos2-7 pos3-4 pos4-0 pos6-1 pos6-4 pos6-7 - place
)

(:init
    (= (total-cost) 0)
    (supporter_turn)
    (free pos0-1)
    (free pos0-2)
    (free pos0-3)
    (free pos0-4)
    (free pos1-4)
    (free pos1-5)
    (free pos1-6)
    (free pos1-7)
    (free pos1-8)
    (free pos2-7)
    (free pos3-4)
    (free pos4-0)
    (free pos6-1)
    (free pos6-4)
    (free pos6-7)
    (at-teleport pos0-1 disabled)
    (at-teleport pos3-4 disabled)
    (teleport_can_be_activated)
    (is-goal pos1-5)
    (at-prime pos0-1)
    (adj-walk pos0-1 pos0-2)
    (adj-walk pos0-2 pos0-1)
    (adj-walk pos0-2 pos0-3)
    (adj-walk pos0-3 pos0-2)
    (adj-walk pos0-3 pos0-4)
    (adj-walk pos0-4 pos0-3)
    (adj-walk pos0-4 pos1-4)
    (adj-walk pos1-4 pos0-4)
    (adj-walk pos1-4 pos1-5)
    (adj-walk pos1-5 pos1-4)
    (adj-walk pos1-5 pos1-6)
    (adj-walk pos1-6 pos1-5)
    (adj-walk pos1-6 pos1-7)
    (adj-walk pos1-7 pos1-6)
    (adj-walk pos1-7 pos1-8)
    (adj-walk pos1-8 pos1-7)
    (adj-walk pos1-7 pos2-7)
    (adj-walk pos2-7 pos1-7)
)

(:goal
  (and
    (at-prime pos1-5)
  )
)
(:metric minimize (total-cost))
)

; plan
1. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
2. (pri_walk pos0-1 pos0-2)
   deleted: (prime_turn) (at-prime pos0-1)
   added: (supporter_turn) (at-prime pos0-2)
   goals met: 0 of 1
3. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
4. (pri_walk pos0-2 pos0-3)
   deleted: (prime_turn) (at-prime pos0-2)
   added: (supporter_turn) (at-prime pos0-3)
   goals met: 0 of 1
5. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
6. (pri_walk pos0-3 pos0-4)
   deleted: (prime_turn) (at-prime pos0-3)
   added: (supporter_turn) (at-prime pos0-4)
   goals met: 0 of 1
7. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
8. (pri_walk pos0-4 pos1-4)
   deleted: (prime_turn) (at-prime pos0-4)
   added: (supporter_turn) (at-prime pos1-4)
   goals met: 0 of 1
9. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
10. (pri_walk pos1-4 pos1-5)
   deleted: (prime_turn) (at-prime pos1-4)
   added: (supporter_turn) (at-prime pos1-5)
   goals met: 1 of 1
